"espk" = "Порт динамика Apple";
"ispk" = "Встроенный";
"emic" = "Порт микрофона";
"imic" = "Встроенный";
"hdpn" = "Порт наушников";
"lini" = "Порт линейного аудиовхода";
"lino" = "Порт линейного аудиовыхода";
"spdi" = "Порт оптического цифрового входа";
"spdo" = "Порт оптического цифрового выхода";
"pci " = "Карта PCI";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "Сетевое устройство";
"blue" = "Bluetooth";
"bluh" = "Наушники Bluetooth";
"blus" = "Гарнитура Bluetooth";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
"airp" = "AirPlay";
